ROBOT_NAME = 'youBot'  #: Название объекта робота
ROBOT_SPEED = 4  #: Скорость робота
ROBOT_STOP_DISTANCE = 1.5  #: Дистанция до препятствия, на которой робот останавливается

SENSOR_MAX_DIST = 5  #: Дальность видимости сенсора (изменять также в файле сенсора в Коппелии)
SENSOR_NUM_POINTS = 181  #: Количество точек сенсора (изменять также в файле сенсора в Коппелии)
SENSOR_MID_SECTOR_WIDTH = 0.66  #: Ширина среднего сектора сенсора
SENSOR_UPDATE_PERIOD = 0.1  #: Период обновления данных на сенсоре, с
