ROBOT_NAME = 'PioneerP3DX'  #: Название объекта робота
ROBOT_SPEED = 2  #: Скорость робота
ROBOT_STOP_DISTANCE = 1.5  #: Дистанция до препятствия, на которой робот останавливается

SENSORS_UPDATE_PERIOD = 0.1  #: Период обновления данных на сенсоре, с

LIDAR_MAX_DIST = 1.5  #: Дальность видимости сенсора (изменять также в файле сенсора в Коппелии)
LIDAR_NUM_POINTS = 181  #: Количество точек сенсора (изменять также в файле сенсора в Коппелии)
LIDAR_MID_SECTOR_WIDTH = 0.66  #: Ширина среднего сектора сенсора

TARGET_NAME = 'Goal'
